In [34]:
import pandas as pd
dataset = pd.read_csv("Placement.csv")

In [35]:
from univariate import univar
quan,qual = univar.quanqual(dataset)

In [36]:
#To find howmany null values present in each column in dataset.
#Here we have null value (empty cell) 60 times in column "salary"
#You can also use dataset.isna().sum()
dataset.isnull().sum()

sl_no              0
gender             0
ssc_p              0
ssc_b              0
hsc_p              0
hsc_b              0
hsc_s              0
degree_p           0
degree_t           0
workex             0
etest_p            0
specialisation     0
mba_p              0
status             0
salary            67
dtype: int64

In [4]:
dataset.isna().sum()

sl_no              0
gender             0
ssc_p              0
ssc_b              0
hsc_p              0
hsc_b              0
hsc_s              0
degree_p           0
degree_t           0
workex             0
etest_p            0
specialisation     0
mba_p              0
status             0
salary            67
dtype: int64

In [5]:
#Fill zero in empty value
# "inplace=True" is used to hold the update in dataset directly. if dataset is assigned in a variiable, then "inplace=True" is not required
dataset["salary"].fillna(0, inplace=True)

In [9]:
#if you want to delete the entire row if there are any null value present in dataset use below.
#dataset.dropna(inplace=True)

In [12]:
#if you want to replace it with Central tendency (Mean/Median/Mode)

dataset["salary"].fillna(dataset["salary"].mean(), inplace=True)

In [50]:
#If we have null values in many columns
#As we are going to replace null value with mean, it will work only for Quantitative data
import numpy as np
from sklearn.impute import SimpleImputer
imp = SimpleImputer(strategy="mean")
# imp.fit(dataset[quan])
# new=imp.transform(dataset[quan])
# quan_imputed = pd.DataFrame(new, columns=quan)
# quan_imputed
quan_imputed = pd.DataFrame(imp.fit_transform(dataset[quan]), columns=quan)

In [51]:
quan_imputed

     sl_no  ssc_p  hsc_p  degree_p  etest_p  mba_p         salary
0      1.0  67.00  91.00     58.00     55.0  58.80  270000.000000
1      2.0  79.33  78.33     77.48     86.5  66.28  200000.000000
2      3.0  65.00  68.00     64.00     75.0  57.80  250000.000000
3      4.0  56.00  52.00     52.00     66.0  59.43  288655.405405
4      5.0  85.80  73.60     73.30     96.8  55.50  425000.000000
..     ...    ...    ...       ...      ...    ...            ...
210  211.0  80.60  82.00     77.60     91.0  74.49  400000.000000
211  212.0  58.00  60.00     72.00     74.0  53.62  275000.000000
212  213.0  67.00  67.00     73.00     59.0  69.72  295000.000000
213  214.0  74.00  66.00     58.00     70.0  60.23  204000.000000
214  215.0  62.00  58.00     53.00     89.0  60.22  288655.405405

[215 rows x 7 columns]

In [6]:
dataset.isna().sum()

sl_no             0
gender            0
ssc_p             0
ssc_b             0
hsc_p             0
hsc_b             0
hsc_s             0
degree_p          0
degree_t          0
workex            0
etest_p           0
specialisation    0
mba_p             0
status            0
salary            0
dtype: int64